Revit 2026 API

# LayerModifierSeparator Property

---

The separator string that will follow this modifier in the export layer name.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string Separator { get; set; }
```
```vb
Public Property Separator As String
	Get
	Set
```
```cpp
public:
property String^ Separator {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member Separator : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

LayerModifier Class

Autodesk.Revit.DB Namespace